<h1>Pandas - Operations</h1>

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi', 'xyz'] })

In [3]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df.tail()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

<h3>Finding Unique Values in a DataFrame</h3>

In [5]:
df['col2'].unique()      # To get the unique values in a column

array([444, 555, 666])

In [6]:
df['col2'].nunique()     # To get the number of unique values in a column

3

In [7]:
df['col2'].value_counts()  # Count how many times the values show up in a column

444    2
555    1
666    1
Name: col2, dtype: int64

<h3>Selecting Data using Conditional Statements</h3>

In [8]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
df[df['col1']>2]    # Refresher for conditonal statements
                    # df[df['some column'] 'some condition']

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [10]:
df[(df['col1']>2) & (df['col2'] == 444)]    # Two conditional statements
                                            # df[(df['some column'] 'some condition') & (df['some column'] 'some condition')]  <--AND

   col1  col2 col3
3     4   444  xyz

In [11]:
df[(df['col1']>2) | (df['col2'] == 444)]    # df[(df['some column'] 'some condition') | (df['some column'] 'some condition')] <--OR

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

<h3>The 'Apply' Method</h3>

In [12]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [13]:
def times2(x):       # Create a function to square a number
    return x*2

In [14]:
df['col1'].apply(times2)    # Use the apply method against a df column
                            # Call in the function just created

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [15]:
df['col3'].apply(len)       # Get the length of a df column
                            # using apply (len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [16]:
df['col2'].apply(lambda x:x*2)  # Use the apply method
                                # with lamdbda to create a times2 function
                                # without using the actual time2 function created above

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

<h3>Removing Columns</h3>

In [17]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [18]:
df.drop('col1',axis=1)      # Drop a column using dataframe.drop method
                            # *Use axis = 1 since this is a column drop*

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

<h3>Getting attributes from the DataFrame</h3>

In [19]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [20]:
df.index

RangeIndex(start=0, stop=4, step=1)

<h3>Sorting and Ordering a DataFrame</h3>

In [21]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [22]:
df.sort_values('col2')      # Sort by Col2 in this example
                            # Usage: df.sort_values('by column or row')
                            # Note: Sorting is in ascending order A -> Z, 1 -> 10

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [26]:
df.sort_values('col3', ascending=False) # This example, sort by col3 
                                        # in descending order

   col1  col2 col3
3     4   444  xyz
2     3   666  ghi
1     2   555  def
0     1   444  abc

In [28]:
df.isnull()     # How to find NULL value(s) in a DataFrame

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

<h4>Pivot Tables</h4>

In [29]:
data = {'A': ['foo','foo','foo','bar','bar','bar'],
        'B': ['one','one','two','two','one','one'],
        'C': ['x','y','x','y','x','y'],
        'D': [1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [30]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [31]:
# Create a Pivot Table/Multi-index
# Usage: df.pivot_table(value ='some value', index='some index(es)', columns='some column(s)')

df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN